Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ0512EFK124.PIC
      <edc:SFRDef edc:_addr="0x1F8100E0" edc:_begin="0xc0" edc:_end="0x130" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IEC2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD5IE" edc:desc="" edc:mask="0x1" edc:name="ADCD5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD6IE" edc:desc="" edc:mask="0x1" edc:name="ADCD6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD7IE" edc:desc="" edc:mask="0x1" edc:name="ADCD7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD8IE" edc:desc="" edc:mask="0x1" edc:name="ADCD8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD9IE" edc:desc="" edc:mask="0x1" edc:name="ADCD9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD10IE" edc:desc="" edc:mask="0x1" edc:name="ADCD10IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD11IE" edc:desc="" edc:mask="0x1" edc:name="ADCD11IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD12IE" edc:desc="" edc:mask="0x1" edc:name="ADCD12IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD13IE" edc:desc="" edc:mask="0x1" edc:name="ADCD13IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD14IE" edc:desc="" edc:mask="0x1" edc:name="ADCD14IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD15IE" edc:desc="" edc:mask="0x1" edc:name="ADCD15IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD16IE" edc:desc="" edc:mask="0x1" edc:name="ADCD16IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD17IE" edc:desc="" edc:mask="0x1" edc:name="ADCD17IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD18IE" edc:desc="" edc:mask="0x1" edc:name="ADCD18IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD19IE" edc:desc="" edc:mask="0x1" edc:name="ADCD19IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD20IE" edc:desc="" edc:mask="0x1" edc:name="ADCD20IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD21IE" edc:desc="" edc:mask="0x1" edc:name="ADCD21IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD22IE" edc:desc="" edc:mask="0x1" edc:name="ADCD22IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD23IE" edc:desc="" edc:mask="0x1" edc:name="ADCD23IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD24IE" edc:desc="" edc:mask="0x1" edc:name="ADCD24IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD25IE" edc:desc="" edc:mask="0x1" edc:name="ADCD25IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD26IE" edc:desc="" edc:mask="0x1" edc:name="ADCD26IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD27IE" edc:desc="" edc:mask="0x1" edc:name="ADCD27IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD28IE" edc:desc="" edc:mask="0x1" edc:name="ADCD28IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD29IE" edc:desc="" edc:mask="0x1" edc:name="ADCD29IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD30IE" edc:desc="" edc:mask="0x1" edc:name="ADCD30IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD31IE" edc:desc="" edc:mask="0x1" edc:name="ADCD31IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD32IE" edc:desc="" edc:mask="0x1" edc:name="ADCD32IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD33IE" edc:desc="" edc:mask="0x1" edc:name="ADCD33IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD34IE" edc:desc="" edc:mask="0x1" edc:name="ADCD34IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD35IE" edc:desc="" edc:mask="0x1" edc:name="ADCD35IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD36IE" edc:desc="" edc:mask="0x1" edc:name="ADCD36IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100F0" edc:_begin="0xc0" edc:_end="0x130" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="2" edc:access="-nnnnnnnnnnnnnnnnnn-nnnnnnnnnnnn" edc:cname="IEC3" edc:desc="" edc:impl="0x7fffefff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000000-000000000000" edc:name="IEC3" edc:nzwidth="32" edc:por="-000000000000000000-000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD37IE" edc:desc="" edc:mask="0x1" edc:name="ADCD37IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD38IE" edc:desc="" edc:mask="0x1" edc:name="ADCD38IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD39IE" edc:desc="" edc:mask="0x1" edc:name="ADCD39IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD40IE" edc:desc="" edc:mask="0x1" edc:name="ADCD40IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD41IE" edc:desc="" edc:mask="0x1" edc:name="ADCD41IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD42IE" edc:desc="" edc:mask="0x1" edc:name="ADCD42IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD43IE" edc:desc="" edc:mask="0x1" edc:name="ADCD43IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD44IE" edc:desc="" edc:mask="0x1" edc:name="ADCD44IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CPCIE" edc:desc="" edc:mask="0x1" edc:name="CPCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFDCIE" edc:desc="" edc:mask="0x1" edc:name="CFDCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SBIE" edc:desc="" edc:mask="0x1" edc:name="SBIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CRPTIE" edc:desc="" edc:mask="0x1" edc:name="CRPTIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIE" edc:desc="" edc:mask="0x1" edc:name="SPI1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIE" edc:desc="" edc:mask="0x1" edc:name="U1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIE" edc:desc="" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIE" edc:desc="" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIE" edc:desc="" edc:mask="0x1" edc:name="I2C1BIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIE" edc:desc="" edc:mask="0x1" edc:name="I2C1SIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIE" edc:desc="" edc:mask="0x1" edc:name="I2C1MIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIE" edc:desc="" edc:mask="0x1" edc:name="CNAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIE" edc:desc="" edc:mask="0x1" edc:name="CNBIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIE" edc:desc="" edc:mask="0x1" edc:name="CNCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIE" edc:desc="" edc:mask="0x1" edc:name="CNDIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNEIE" edc:desc="" edc:mask="0x1" edc:name="CNEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNFIE" edc:desc="" edc:mask="0x1" edc:name="CNFIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNGIE" edc:desc="" edc:mask="0x1" edc:name="CNGIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNHIE" edc:desc="" edc:mask="0x1" edc:name="CNHIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNJIE" edc:desc="" edc:mask="0x1" edc:name="CNJIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x7fffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
